---
kind: method
id: M:Autodesk.Revit.DB.ReferenceIntersector.#ctor(Autodesk.Revit.DB.ElementFilter,Autodesk.Revit.DB.FindReferenceTarget,Autodesk.Revit.DB.View3D)
zh: 射线、射线相交
source: html/929ca688-af0f-6e6a-d812-44017c8955e7.htm
---
# Autodesk.Revit.DB.ReferenceIntersector.#ctor Method

**中文**: 射线、射线相交

Constructs a ReferenceIntersector which is set to return intersections from any element which passes an input filter.

## Syntax (C#)
```csharp
public ReferenceIntersector(
	ElementFilter filter,
	FindReferenceTarget targetType,
	View3D view3d
)
```

## Parameters
- **filter** (`Autodesk.Revit.DB.ElementFilter`) - The element filter. All references will belong to elements passing this filter.
- **targetType** (`Autodesk.Revit.DB.FindReferenceTarget`) - The target type of references to return.
- **view3d** (`Autodesk.Revit.DB.View3D`) - The view in which to find references.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Returns true if the view is not a view template.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration